uhnp/src/InformationRegisters/РазмещениеЗаявок/РазмещениеЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазмещениеЗаявок</name>
  <resources>
    <name>БанковскийСчетКасса</name>
    <type>
      <types>DefinedType.БанковскийСчетКасса</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.АналитикаПланированияКонтрагент</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗапретИзмененияДаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаОплаты</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ВидОперацииУХ</name>
    <type>
      <types>CatalogRef.ВидыОперацийУХ</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетКонтрагента</name>
    <type>
      <types>DefinedType.БанковскийСчетКонтрагента</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретИзмененияБанковскогоСчетаКассы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретРазбиенияСлияния</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторВстречнойПозиции</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>КратностьПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.ПриоритетыПлатежей</types>
    </type>
  </resources>
  <resources>
    <name>БезакцептноеСписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияКурсаПлатежа</name>
    <type>
      <types>EnumRef.СпособыОпределенияКурсаПлатежа</types>
    </type>
  </resources>
  <resources>
    <name>ДатаФиксацииКурсаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеБолее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеМенее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеМенееВВалютеОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеБолееВВалютеОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СдвигДатыФиксацииКурсаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КрайняяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсУстановленВЗаявке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаявкаНаОперацию</name>
    <type>
      <types>DefinedType.ДокументыПлатежнойПозиции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПозиции</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СостоянияИсполненияДокументовПланирования/СостоянияИсполненияДокументовПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияИсполненияДокументовПланирования</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеИсполнения</name>
    <type>
      <types>EnumRef.СостоянияИсполненияЗаявки</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИзменившийСостояние</name>
    <type>
      <types>DefinedType.ДокументыИзменяющиеСостояниеДокументовПланирования</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументПланирования</name>
    <type>
      <types>DefinedType.ДокументыПлатежнойПозиции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПозиции</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccumulationRegisters/РасчетыСКонтрагентамиФакт/РасчетыСКонтрагентамиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКонтрагентамиФакт</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговораУХ</name>
    <type>
      <types>CatalogRef.ВидыДоговоровКонтрагентовУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальныеОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетовУХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСтруктурыЗадолженности</name>
    <type>
      <types>EnumRef.ЭлементыСтруктурыЗадолженности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/InformationRegisters/АналитикаКонтроляПоДоговорам/АналитикаКонтроляПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаКонтроляПоДоговорам</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиКонтроляПоДоговорам</types>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>DefinedType.ДоговорКонтрагента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияСоглашения</name>
    <type>
      <types>DefinedType.ВерсияСоглашения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийПриходРасход</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияИсполненияЗаявки/СостоянияИсполненияЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияИсполненияЗаявки</name>
  <enumValues>
    <name>НеОбработана</name>
  </enumValues>
  <enumValues>
    <name>Отложена</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВРеестрПлатежей</name>
  </enumValues>
  <enumValues>
    <name>НаИсполнении</name>
  </enumValues>
  <enumValues>
    <name>Исполнена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/РежимыКонтроляДокументов/РежимыКонтроляДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыКонтроляДокументов</name>
  <enumValues>
    <name>Блокировать</name>
  </enumValues>
  <enumValues>
    <name>Информировать</name>
  </enumValues>
  <enumValues>
    <name>НеКонтролировать</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/КлючиКонтроляПоДоговорам/КлючиКонтроляПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиКонтроляПоДоговорам</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>DefinedType.ДоговорКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСоглашения</name>
    <type>
      <types>DefinedType.ВерсияСоглашения</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/ChartsOfCharacteristicTypes/ВидыКонтроляДокументов/ВидыКонтроляДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыКонтроляДокументов</name>
  <type>
    <types>CatalogRef.КлючиКонтроляПоДоговорам</types>
    <types>CatalogRef.КлючиКонтроляОбъемаЗакупок</types>
    <types>CatalogRef.КлючиКонтроляЗадолженностиПоКонтрагенту</types>
    <types>CatalogRef.КлючиАналитикиПланированияРасчетовСКонтрагентами</types>
    <types>CatalogRef.КлючиКонтроляБюджетныхЛимитовРезервов</types>
  </type>
  <predefined>
    <items>
      <name>КонтрольБюджетныхЛимитов</name>
      <description>Контроль бюджетных лимитов</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.КлючиКонтроляБюджетныхЛимитовРезервов</types>
      </type>
    </items>
    <items>
      <name>КонтрольБюджетныхРезервов</name>
      <description>Контроль бюджетных резервов</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.КлючиКонтроляБюджетныхЛимитовРезервов</types>
      </type>
    </items>
    <items>
      <name>КонтрольМаксимальнойСуммыЗадолженностиПоДоговору</name>
      <description>Контроль задолженности по договору</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.КлючиКонтроляПоДоговорам</types>
      </type>
    </items>
    <items>
      <name>КонтрольОбщейЗадолженностиКонтрагента</name>
      <description>Контроль задолженности по контрагенту</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.КлючиКонтроляЗадолженностиПоКонтрагенту</types>
      </type>
    </items>
    <items>
      <name>КонтрольОбъемаЗакупок</name>
      <description>Контроль подтвержденного объема закупок</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.КлючиКонтроляОбъемаЗакупок</types>
      </type>
    </items>
    <items>
      <name>КонтрольРасходовПоДоговору</name>
      <description>Контроль расходов по договору</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.КлючиКонтроляПоДоговорам</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>РежимКонтроля</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

uhnp/src/CommonModules/КонтрольУХВзаиморасчетыПоДоговору/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает объект-проверку
Функция Создать() Экспорт
	
	Проверка = КонтрольУХ.Новый_Проверка();
	Проверка.Объект = КонтрольУХВзаиморасчетыПоДоговору;
	Проверка.Источник = ИмяИсточника();
	Проверка.ВидКонтроля = ПланыВидовХарактеристик.ВидыКонтроляДокументов.КонтрольМаксимальнойСуммыЗадолженностиПоДоговору;
	Проверка.ИмяРеквизита = "ЕстьПревышениеЛимитыВзаиморасчеты";
	
	Возврат Проверка;
	
КонецФункции

// Функция возвращает Истина, если для этого документа проверка выполняется
Функция ТребуетсяДляДокумента(ИмяДокумента) Экспорт
	
	Возврат ИмяДокумента = "ЗаявкаНаРасходованиеДенежныхСредств"
		ИЛИ ИмяДокумента = "ОжидаемоеПоступлениеДенежныхСредств";
	
КонецФункции

// Функция возвращает Истина, если требуется выполнение проверки исходя из данных источника
Функция ТребуетсяПроверка(ПараметрыКонтроля, Источник) Экспорт
	
	Если ТипЗнч(Источник) <> Тип("Структура") ИЛИ НЕ Источник.Свойство("Договор") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(Источник.Договор);
	
КонецФункции

// Функция выполняет обработку данных источника
Функция ОбработатьДанныеИсточника(ИнформацияДляКонтроля, Источник) Экспорт
	
	//
	Запрос = Новый Запрос;
	Для Каждого КлючЗначение Из Источник Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Запрос.Контрагент КАК Контрагент,
	|	Запрос.Договор КАК Договор,
	|	Запрос.Валюта КАК Валюта,
	|	СУММА(Запрос.Заявлено) КАК Заявлено,
	|	СУММА(Запрос.Исполнено) КАК Исполнено
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	(ВЫБРАТЬ
	|		РазмещениеЗаявок.Контрагент КАК Контрагент,
	|		РазмещениеЗаявок.ДоговорКонтрагента КАК Договор,
	|		РазмещениеЗаявок.ВалютаВзаиморасчетов КАК Валюта,
	|		ВЫБОР
	|			КОГДА РазмещениеЗаявок.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|				ТОГДА РазмещениеЗаявок.СуммаВзаиморасчетов
	|			ИНАЧЕ -РазмещениеЗаявок.СуммаВзаиморасчетов
	|		КОНЕЦ КАК Заявлено,
	|		0 КАК Исполнено
	|	ИЗ
	|		РегистрСведений.РазмещениеЗаявок КАК РазмещениеЗаявок
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИсполненияДокументовПланирования.СрезПоследних КАК СостоянияИсполненияДокументовПланированияСрезПоследних
	|			ПО РазмещениеЗаявок.ЗаявкаНаОперацию = СостоянияИсполненияДокументовПланированияСрезПоследних.ДокументПланирования
	|				И РазмещениеЗаявок.ИдентификаторПозиции = СостоянияИсполненияДокументовПланированияСрезПоследних.ИдентификаторПозиции
	|				И (СостоянияИсполненияДокументовПланированияСрезПоследних.СостояниеИсполнения В (ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НеОбработана), ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НаИсполнении), ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.ВключенаВРеестрПлатежей)))
	|	ГДЕ
	|		РазмещениеЗаявок.ДоговорКонтрагента = &Договор
	|		И РазмещениеЗаявок.ЗаявкаНаОперацию <> &Заявка
	|		И РазмещениеЗаявок.Проведен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоСрокамОстатки.Контрагент,
	|		РасчетыСПоставщикамиПоСрокамОстатки.ДоговорКонтрагента,
	|		РасчетыСПоставщикамиПоСрокамОстатки.Валюта,
	|		0,
	|		РасчетыСПоставщикамиПоСрокамОстатки.СуммаОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСКонтрагентамиФакт.Остатки(, ДоговорКонтрагента = &Договор) КАК РасчетыСПоставщикамиПоСрокамОстатки) КАК Запрос
	|
	|СГРУППИРОВАТЬ ПО
	|	Запрос.Контрагент,
	|	Запрос.Договор,
	|	Запрос.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыКонтроляДокументов.КонтрольМаксимальнойСуммыЗадолженностиПоДоговору) КАК ВидКонтроля,
	|	ЗНАЧЕНИЕ(Справочник.КлючиКонтроляПоДоговорам.ПустаяСсылка) КАК КлючКонтроля,
	|	ВерсияСоглашенияКоммерческийДоговор.Организация КАК Организация,
	|	ВерсияСоглашенияКоммерческийДоговор.Контрагент КАК Контрагент,
	|	ВерсияСоглашенияКоммерческийДоговор.ДоговорКонтрагента КАК Договор,
	|	ВерсияСоглашенияКоммерческийДоговор.Ссылка КАК ВерсияСоглашения,
	|	ВерсияСоглашенияКоммерческийДоговор.ВалютаВзаиморасчетов КАК Валюта,
	|	ВерсияСоглашенияКоммерческийДоговор.ДопустимаяСуммаЗадолженности КАК Лимит,
	|	0 КАК Зарезервировано,
	|	ЕСТЬNULL(ВТ_Данные.Заявлено, 0) КАК Заявлено,
	|	ЕСТЬNULL(ВТ_Данные.Исполнено, 0) КАК Исполнено,
	|	0 КАК ЛимитИзменение,
	|	&СуммаПлатежа КАК ЗаявленоИзменение,
	|	0 КАК ЗарезервированоИзменение,
	|	0 КАК ИсполненоИзменение,
	|	ВерсияСоглашенияКоммерческийДоговор.ДопустимаяСуммаЗадолженности - ЕСТЬNULL(ВТ_Данные.Заявлено, 0) - ЕСТЬNULL(ВТ_Данные.Исполнено, 0) - &СуммаПлатежа КАК ДоступноПослеОперации,
	|	ЛОЖЬ КАК КонтрольНарушен
	|ИЗ
	|	Документ.ВерсияСоглашенияКоммерческийДоговор КАК ВерсияСоглашенияКоммерческийДоговор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Данные КАК ВТ_Данные
	|		ПО ВерсияСоглашенияКоммерческийДоговор.ДоговорКонтрагента = ВТ_Данные.Договор
	|			И ВерсияСоглашенияКоммерческийДоговор.ВалютаВзаиморасчетов = ВТ_Данные.Валюта
	|ГДЕ
	|	ВерсияСоглашенияКоммерческийДоговор.ДоговорКонтрагента = &Договор
	|	И ВерсияСоглашенияКоммерческийДоговор.Ссылка = ВерсияСоглашенияКоммерческийДоговор.ДоговорКонтрагента.ВерсияСоглашения";
	
	Результат = Запрос.Выполнить();
	
	Данные = Результат.Выгрузить();
	
	Возврат Данные;
	
КонецФункции

// Процедура выполняет контроль обработанных данных
Функция ВыполнитьКонтроль(ИнформацияДляКонтроля, ДанныеДляКонтроля) Экспорт
	
	КонтрольНарушен = Ложь;
	
	Если ЗначениеЗаполнено(ДанныеДляКонтроля) Тогда
	
		Для Каждого Строка Из ДанныеДляКонтроля Цикл
			
			Доступно = Окр(Строка.Лимит, 2) + Окр(Строка.ЛимитИзменение, 2) 
				- Окр(Строка.Зарезервировано, 2) - Окр(Строка.ЗарезервированоИзменение, 2)
				- Окр(Строка.Заявлено, 2) - Окр(Строка.ЗаявленоИзменение, 2)
				- Окр(Строка.Исполнено, 2) - Окр(Строка.ИсполненоИзменение, 2);
			
			Строка.КонтрольНарушен = Доступно < 0;
			КонтрольНарушен = КонтрольНарушен ИЛИ Строка.КонтрольНарушен;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат КонтрольНарушен;
	
КонецФункции

// Функция возвращает Истина, если нарушение контроля должно приводить к блокированию проведения
Функция БлокироватьПроведение(КлючКонтроля) Экспорт
	
	РежимКонтроля = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.ВидыКонтроляДокументов.КонтрольМаксимальнойСуммыЗадолженностиПоДоговору, "РежимКонтроля");
	Возврат РежимКонтроля = Перечисления.РежимыКонтроляДокументов.Блокировать
	
КонецФункции

// Возвращает имя источника для проверки
//
Функция ИмяИсточника() Экспорт
	
	Возврат "ЗадолженностьПоДоговору";
	
КонецФункции

// Процедура возвращает табличный документ с расшифровкой контроля документа
//
Функция СформироватьРасшифровкуКонтроля(Проверка, СтрокаКонтроль) Экспорт
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаКонтроль.Документ, "ЦФО, Проект");
	РезультатКонтроля = ПолучитьИзВременногоХранилища(СтрокаКонтроль.АдресРезультата);
	ДанныеКонтроля = РезультатКонтроля.Скопировать();
	
	// КОНТРОЛЬ ЗАДОЛЖЕННОСТИ ПО ДОГОВОРУ
	ДанныеКонтроля.Колонки.Добавить("КонтрагентПредставление");
	ВсеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		ДанныеКонтроля.ВыгрузитьКолонку("Контрагент"), "Наименование, НаименованиеПолное");
	Для Каждого Строка Из ДанныеКонтроля Цикл
		Реквизиты = ВсеРеквизиты[Строка.Контрагент];
		Если Реквизиты = неопределено Тогда
			Строка.КонтрагентПредставление = НСтр("ru = 'Не указан'");
		ИначеЕсли ЗначениеЗаполнено(Реквизиты.НаименованиеПолное) Тогда
			Строка.КонтрагентПредставление = Реквизиты.НаименованиеПолное;
		Иначе
			Строка.КонтрагентПредставление = Реквизиты.Наименование;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СформироватьОтчетКонтрольВзаиморасчетовПоДоговору(СтрокаКонтроль, ДанныеКонтроля);
	
КонецФункции
	
// Процедура сохраняет данные для контроля в табличной части документа
//
// Параметры:
//  ДанныеДляКонтроля	- Таблица значений	- Результат контроля
//  РезультатыКонтроля	- ТабличнаяЧасть	- табличная часть РезультатыКонтроля проверяемого документа
//
Процедура СохранитьДанныеДляКонтроляВДокументе(ДанныеДляКонтроля, РезультатыКонтроля) Экспорт
	
	Инфо = РегистрыСведений.АналитикаКонтроляПоДоговорам.ИнформацияОКлюче();
	ИменаПолей = КонтрольУХКлючи.ИменаПолейКоллекцииПоУмолчанию(Инфо);
	ИменаПолей.АналитикаКонтроляПоДоговорам = "КлючКонтроля";
	
	КонтрольУХКлючи.ЗаполнитьВКоллекции(Инфо, ДанныеДляКонтроля, ИменаПолей);
	
	// Загрузить результат контроля в тч.РезультатыКонтроля
	Для Каждого Строка Из ДанныеДляКонтроля Цикл
		ЗаполнитьЗначенияСвойств(РезультатыКонтроля.Добавить(), Строка);
	КонецЦикла;
	
КонецПроцедуры // СохранитьДанныеДляКонтроляВДокументе()
	
// Функция возвращает соответствие с описанием колонок таблицы данных контроля, которые получаются из ключа контроля
//
// Возвращаемое значение:
//   Соответствие   - {ИмяКолонки, Структура("ИмяКолонки, ОписаниеТипа, ПутьКДанным")}
//
Функция КолонкиДанныхКонтроля() Экспорт
	
	Колонки = Новый Соответствие;
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"Организация",
		Новый ОписаниеТипов("СправочникСсылка.Организации"));
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"Контрагент",
		Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	КонтрольУХ.ДобавитьКолонкуКонтроля(Колонки, 
		"Договор",
		Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	
	Результат = Новый Структура;
	Результат.Вставить("Источник", "Справочник.КлючиКонтроляПоДоговорам");
	Результат.Вставить("Колонки", Колонки);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьОтчетКонтрольВзаиморасчетовПоДоговору(СтрокаКонтроль, ДанныеКонтроля) экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПланыВидовХарактеристик.ВидыКонтроляДокументов.ПолучитьМакет("КонтрольЛимитовВзаиморасчетовПоДоговору");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ОбластьЗаголовок.Параметры.Документ = СтрокаКонтроль.Документ;
	
	ОбластьЗаголовок.Параметры.ДатаВремяКонтроля = СтрокаКонтроль.ВремяПроверки;
	ОбластьЗаголовок.Параметры.ТекущееВремя = ТекущаяДатаСеанса();
	ОбластьЗаголовок.Параметры.ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);

	//
	ТабДок.НачатьАвтогруппировкуСтрок();
	Для каждого Данные Из ДанныеКонтроля Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(Данные);
		ОбластьДетальныхЗаписей.Параметры.ДоступноПослеОперации = 
			Данные.Лимит + Данные.ЛимитИзменение
			- Данные.Исполнено - Данные.ИсполненоИзменение
			- Данные.Зарезервировано - Данные.ЗарезервированоИзменение 
			- Данные.Заявлено - Данные.ЗаявленоИзменение;
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла; 
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
	//
	ДанныеКонтроля.Свернуть("", "Лимит, Исполнено, Зарезервировано, Заявлено, ЛимитИзменение, ИсполненоИзменение, ЗарезервированоИзменение, ЗаявленоИзменение");
	Если ДанныеКонтроля.Количество()>0 Тогда
		Данные = ДанныеКонтроля[0];
		ОбластьПодвалТаблицы.Параметры.Заполнить(Данные);
		ОбластьПодвалТаблицы.Параметры.ДоступноПослеОперации = 
			Данные.Лимит + Данные.ЛимитИзменение
			- Данные.Исполнено - Данные.ИсполненоИзменение
			- Данные.Зарезервировано - Данные.ЗарезервированоИзменение 
			- Данные.Заявлено - Данные.ЗаявленоИзменение;
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти
